In [69]:
import numpy as np 
import pandas as pd

In [77]:
data = [1,2,3,4]
data

[1, 2, 3, 4]

In [70]:
# (1) get [1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4]
# ?

In [29]:
# (2) get [10, 20, 30, 40]
# ?
# ?

In [75]:
# (3) get below
# ?
# ?

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [76]:
# (4) get below
# ?
# ?

      0   1   2   3  sum
0     0   1   2   3    6
1     4   5   6   7   22
2     8   9  10  11   38
sss  12  15  18  21   66